Revit 2026 API

# ReinforcementSettingsNumberingMethod Property

---

Identifies the type of the numbering method.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReinforcementNumberingMethod NumberingMethod { get; set; }
```
```vb
Public Property NumberingMethod As ReinforcementNumberingMethod
	Get
	Set
```
```cpp
public:
property ReinforcementNumberingMethod NumberingMethod {
	ReinforcementNumberingMethod get ();
	void set (ReinforcementNumberingMethod value);
}
```
```fsharp
member NumberingMethod : ReinforcementNumberingMethod with get, set
```

#### Property Value

ReinforcementNumberingMethod

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This property can be used to modify the way that rebar sets with varying length bars are numbered.

#### Reference

ReinforcementSettings Class

Autodesk.Revit.DB.Structure Namespace